<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use App\Models\Book;
use Carbon\Carbon;

class BookSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        $books = [
            [
                'title' => 'فن اللامبالاة',
                'author' => 'مارك مانسون',
                'genre' => 'تنمية ذاتية',
                'description' => 'ظل يُقال لنا طيلة عشرات السنوات إن التفكير الإيجابي هو المفتاح إلى حياة سعيدة ثرية. لكن مارك مانسون يشتم تلك "الإيجابية" ويقول: " فلنكن صادقين، السيء سيء وعلينا أن نتعايش مع هذا ". لا يتهرّب مانسون من الحقائق ولا يغلفها بالسكّر، بل يقولها لنا كما هي: جرعة من الحقيقة الفجِّة الصادقة المنعشة هي ما ينقصنا اليوم. هذا الكتاب ترياق للذهنية التي نهدهد أنفسنا بها، ذهنية " فلنعمل على أن يكون لدينا كلنا شعور طيب " التي غزت المجتمع المعاصر فأفسدت جيلًا بأسره صار ينال ميداليات ذهبية لمجرد الحضور إلى المدرسة. ينصحنا مانسون بأن نعرف حدود إمكاناتنا وأن نتقبلها. وأن ندرك مخاوفنا ونواقصنا وما لسنا واثقين منه، وأن نكفّ عن التهرب والفرار من ذلك كله ونبدأ مواجهة الحقائق الموجعة، حتى نصير قادرين على العثور على ما نبحث عنه من جرأة ومثابرة وصدق ومسؤولية وتسامح وحب للمعرفة. لا يستطيع كل شخص أن يكون متميزًا متفوقًا. ففي المجتمع ناجحين وفاشلين؛ وقسم من هذا الواقع ليس عادلًا وليس نتيجة غلطتك أنت. وصحيح أن المال شيء حسن، لكن اهتمامك بما تفعله بحياتك أحسن كثيرًا؛ فالتجربة هي الثروة الحقيقية',
                'publication_date' => '2018-01-01',
                'publisher' => 'دار التنوير للطباعة والنشر والتوزيع',
                'pages_count' => 328,
                'image_url' => 'books_covers/1.jpeg',
            ],
            [
                'title' => 'لا تحزن',
                'author' => 'عائض القرني',
                'genre' => 'إسلامي',
                'description' => 'عيدُ على خيرِ حالٍ عدْتَ يا عيدُ فنحنُ في مسمعِ الدنيا أناشيدُ على شفاهِ فمِ العلياءِ بسمتُنا ومن غمامِ سمانا يُورقُ العُودُ من ليلةِ الغارِ فارقْنا مآتِـمَنا منْ وقعِ «لا تحزنْ» انسابتْ تغاريدُ وكيفَ نحزنُ والكونُ انتشى طرباً من هدي (اقرأ) توحيدٌ وتجديدُ وكيفَ نأسى وفي أرواحِنا ألَقٌ من رحمةِ اللهِ منها تُعشبُ البِيدُ نحنُ الحياةُ فهل تقسو الحياةُ بنا من وحيِنا سالَ بالأنهارِ جُلمودُ ونحنُ قصةُ حبٍّ صاغَها مثلاً محمدٌ وتلاهُ السادةُ الصِّيدُ بلالُ أَطلقها، سلمانُ صدَّقها عمَّارُ عانَقها والبيضُ والسودُ فاخلعْ رداءَ المآسي وابتهجْ فرَحاً في موكبِ اللهِ تقديسٌ وتحميدُ الفجرُ يَضحكُ والشمسُ اكتستْ حُللاً منَ البهاءِ وهذا البدرُ مولودُ وللنجومِ ابتسامٌ ساحرٌ سطعتْ في الليلِ أعلامُهُ والنُّورُ ممدودُ أما ترى الزّهرَ حيّانا بِطلعتِهِ يفتُّر عنْ بسمةٍ في حسنِها العيدُ كُنْ كالضُّحى مُشرقاً أوْ كالسَّنا ألَقاً فالبرقُ قبلَ نزولِ الغيثِ محمودُ الطيرُ غنّى ومالَ الغصنُ مُنتشِياً والنَّهرُ صفّقَ والوادي زغاريدُ فودِّعِ الهمَّ فالدنيا مُوَلّيةٌ وبشِّرِ النفْسَ فالبشرى مواعيدُ',
                'publication_date' => '2016-01-01',
                'publisher' => 'العبيكان للنشر',
                'pages_count' => 928,
                'image_url' => 'books_covers/2.jpeg',
            ],
            [
                'title' => 'العقل الباطن',
                'author' => 'سلامة موسى',
                'genre' => 'علم نفس',
                'description' => '«العقل الباطن أو مكنونات النفس» هو كتاب لسلامة موسى، يلخص فيه ما قرأه لأقطاب علماء النفس الغربيين، أمثال سيغموند فرويد النمساوي، وكارل يونج السويسري، وأدلر الفرنسي، ورفرز الإنجليزي. وقد حرص موسى في هذا العمل أن يتجنب المصطلحات العلمية قدر الإمكان، وأن يكتب بأسلوب سلس وسهل، ييسر علي القاريء فهم الأفكار والنظريات دون تعقيد أوغموض. ويبحث هذا الكتاب في العقل الباطن أو اللاوعي، والدور المركزي الذي يلعبه في تحريك النفس البشرية، كما يبين لنا الكتاب كيف تتجلى مظاهر المرتبطة بالعقل الباطن في الخواطر الأوهام والأحلام التي تخالج نفس الإنسان. بالإضافة إلى ذلك يوضح لنا الكاتب كيف يمكن للإنسان أن يتعامل نفسيًا مع الهموم والأمراض الناتجة عن الكبت والتراكم المستمر للأشياء في اللاوعي.',
                'publication_date' => '2012-01-01',
                'publisher' => 'مؤسسة هنداوي للتعليم والثقافة',
                'pages_count' => 175,
                'image_url' => 'books_covers/3.jpeg',
            ],
            [
                'title' => 'كيفما فكرت فكر العكس',
                'author' => 'بول آردن',
                'genre' => 'تطوير ذاتي',
                'description' => 'كيفما فكرت .. فكر بالعكس يغزو رؤيتنا للعمل والعالم حولنا. بدلاً من النصيحة المملة المعتادة، يقدّم بول آردن سخرية جريئة، أقوالاً مأثورة، ومفارقات. يصوّبها على "فطرتنا السليمة" ليحثّنا على مراجعتها. فمهما كانت السلعة التي تبتغي تسويقها، ومهما كان ما تديره أو تشتريه، يلهمك آردن بأفكاره الفريدة، وهو الحكواتي المذهل.يبهرك بصوره الفوتوغرافية، وبأقوال خارجة عن المألوف يستعيرها من فنانين وعلماء وفلاسفة. كيفما فكرت .. فكر بالعكس سيحدث شرخاً في أفكارك الراسخة - حتى حين لا تكون مدركاً أنك تفكّر على نحو معيّن. سيمنحك الثقة لتقدم على مجازفات أكبر، لتستمتعك بملك أكثر مما بوسعك تخيّله',
                'publication_date' => '2012-01-01',
                'publisher' => 'دار الساقي للطباعة والنشر',
                'pages_count' => 113,
                'image_url' => 'books_covers/4.jpeg',

            ],
            [
                'title' => 'عقدك النفسية سجنك الأبدي',
                'author' => 'يوسف الحسني',
                'genre' => 'علم نفس',
                'description' => 'نُولَد بفضول وشغف لاكتشاف العالم، نحاول جاهدين معرفة مَن نحن، ولكنهم يصنعون منا نسخًا، نلقن موروثات الأبوين الفكرية، نرى العالم من خلال عيونهما وليس عيوننا، نستمد استحقاقًا مزيفًا من المال أو السلطة أو الجمال الخارجي أو شخص يقبل بنا في علاقة، قد نتعلق بمَن يسلخنا عن أنفسنا ولا نعرف السر، كيف نتعافى عاطفيًّا إذا لم نكشف الشفرة التحليلية، كيف نعرف إن كنا مجرد احتياط في حياة مَن نعدُّه الحياة، كيف ننضج؟ هل نخاف المواجهة لأننا تعلمنا مراعاة شعور الآخر على حساب أنفسنا، هل تم تأسيسنا بثقافة جنسية سوية؟',
                'publication_date' => '2021-01-01',
                'publisher' => 'عصير الكتب للنشر والتوزيع',
                'pages_count' => 288,
                'image_url' => 'books_covers/5.jpeg',

            ],
            [
                'title' => 'كن أنت: رحلة البحث عن ذاتك الكونية',
                'author' => 'إيهاب حمارنة',
                'genre' => 'تطوير ذاتي',
                'description' => 'كل نفس على الأرض تسعى بوعي او من دون وعي للعودة إلى أصلها الروحي، وهنا يلبي الكتاب هذا المطلب الملتهب، ليعمل كالمرشد لك في رحلتك الداخلية إلى أصلك الواحد. لا يسعى الكتاب ان يكون جرعة تحفيزية، أو حتى ليرمي ببعض التقنيات في التنمية البشرية، وانما هو مرشد صادق وشجاع في صلب اكتشاف الذات والتعبير الصادق عنها. يعرف د.إيهاب، الكاتب، في أسلوبه المتكامل الذي يحاكي الروح والعملية على حد سواء، ومن خلال المزج بين تعاليم الوعي والقصص والأمثلة، ليقدم لك خطاب شمولي لنهضتك ونهضة الجنس الإنساني ككل. قد قام إيهاب من خلال رسالة كن انت، والتي شاهدها الملايين حول العالم، بمشاركة رسائل عميقة وملهمة في صلب اكتشاف الذات والتمكين النفسي، ليأتي هذا الكتاب كزبدة فلسفته البسيطة في الحياة، ليساعدك أن تعيش رسالتك الحقيقة على الأرض.',
                'publication_date' => '2021-01-01',
                'publisher' => 'دار ملهمون للنشر والتوزيع',
                'pages_count' => 473,
                'image_url' => 'books_covers/6.jpeg',

            ],
            [
                'title' => 'انفعالات النفس',
                'type' => 'كتاب',
                'author' => 'تأليف رينيه ديكارت (تأليف) جورج زيناتي (ترجمة)',
                'publisher' => 'دار الرافدين للطباعة والنشر والتوزيع',
                'pages' => 233,
                'published_year' => 2019,
                'description' => 'كن أكثر تنظيماً بقليل، تكن حياتك أسهل بكثير. سواء كنت والداً، أو طالباً، أو حتى مديراً تنفيذياً في شركة، ستكون إدارة الأمور أكثر سهولة عندما تكون منظّماً. يساعدك هذا الكتاب في تحديد أسلوبك التنظيمي بخطوات بسيطة يمكنك القيام بها لمعالجة الفوضى في مجالات حياتك كافة. تُظهر لك هارييت جريفي كيف يمكن لاتباع روتينٍ وعاداتٍ بسيطة أن يصنع كل الفرق. كتاب مليءٌ بالحلول العملية والنصائح والأفكار الملهمة لتقليل الفوضى والتوتر، ما يترك لك مساحة أكبر من المكان والزمان لتستمع بالحياة',
                'image_url' => 'books_covers/7.jpeg',
            ],
            [
                'title' => 'كيف أنظم حياتي',
                'type' => 'كتاب',
                'author' => 'هارييت جريفي',
                'publisher' => 'دار الساقي للطباعة والنشر',
                'pages' => 169,
                'published_year' => 2020,
                'description' => 'كن أكثر تنظيماً بقليل، تكن حياتك أسهل بكثير. سواء كنت والداً، أو طالباً، أو حتى مديراً تنفيذياً في شركة...',
                'image_url' => 'books_covers/8.jpeg',

            ],
            [
                'title' => 'فلنحيينه حياة طيبة',
                'type' => 'كتاب',
                'author' => 'داليا حجازي',
                'publisher' => 'ديير للنشر والتوزيع',
                'pages' => 194,
                'published_year' => 2025,
                'description' => 'أشعر بك وما يؤرقك من مشاعر مختلطة ما بين التعب، الحزن، الإحباط، وما بين الحمد والرضا.. أحب أن أخبرك أن هذا طبيعي لأنك إنسان،تعيش حياة مليئة بالمصاعب والتحديات والمهمات اليومية، وبكثيرٍ من الأدوار التي تلعبها كل يوم، والمسؤوليات التي تؤديها. أنا مثلك في هذه الدائرة التي أسير داخلها أحيانًا بلا توقف وكأنني فى حلقة سباق ولا أرى خط النهاية، ولكني مررت بتجربة شخصية منذ عدة سنوات كانت بمنزلة نقطة تحول جذرية في حياتي وطريقة تفكيري؛جعلتني أعيد تصميم حياتي من جديد، وليس أي حياة، هي الحياة التي أحب أن أعيشها من جديد لتجعلني أزهر على مراد الله عز وجل، لذا أحببت أن يكون عنوان هذا الكتاب {فَلَنُحْيِيَنَّهُ حَيَاةً طَيِّبَةً}.',
                'image_url' => 'books_covers/9.jpeg',

            ],
        ];

        foreach ($books as $book) {
            try {
                Book::create($book);
                echo "Inserted: " . $book['title'] . "\n";
            } catch (\Exception $e) {
                echo "Error inserting " . $book['title'] . ": " . $e->getMessage() . "\n";
            }
        }
    }
}
